# organization-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/organization_api]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=f8a62hnynh]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role.lambda_role: Refreshing state... [id=le-organization_api]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=production]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.data.curl.cognito_user_pool_keys: Reading...
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=d8a7046f-2604-4b33-94b0-0ffbf472b6c9:organization_api]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-organization_api-20230527203759368500000001]
module.common_resources.data.curl.cognito_user_pool_keys: Read complete after 0s [id=1686041789]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/organization_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-f627d8e0-ce7f-453a-82f7-d74842bcb5da]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-86956032-29ef-4f76-8155-c39f14e699c8]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 1s [id=9901834e9db095236d77c2a16a0c1b266b7e32b0]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=organization_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=yu3ct3b]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any["all"]: Refreshing state... [id=s4aur8q]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "organization_api"
      ~ last_modified                  = "2023-06-04T08:59:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "nWiN5XSNZIUzgB4tfj8mK7IJiesKvF9E25ELHaoP9ss=" -> "IGdKNdlIo1tAngLAgD1jFNEj4GsMb7+lObeSqAeyviM="
        tags                           = {
            "domain"        = "organization"
            "environment"   = "production"
            "resource"      = "organization-api"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS"                           = "oriented-mongoose-7714-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"                                 = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"                                  = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"                                    = "211d089e15874b9489b18667958dca1e"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"                              = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"                                    = "b3JpZW50ZWQtbW9uZ29vc2UtNzcxNCSR9CEq4XqSjhBrNb6qCFJ3mdmx_t8V1TA"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"                                 = (sensitive value)
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_DEFAULT_KEYS"             = jsonencode(
                    {
                      - keys = [
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "u5jk8CS+Mj5ChLjpi2fIlkWQNKBi1LqJ6qJlHk9Bueo="
                              - kty = "RSA"
                              - n   = "s5cVjyvPtBEaXFzQW8cNEhLa62Kz7UZnbLOd53MuzGtjCoP62B0p6jvdw0_RcForupCUSqXM0XRg--8B6J2ixxBqjUhUBzwViL0Wv1-XIK-m79F4n_RlH7WhmD8UUAjjtt8M-Z7wzZTcB60IgDD8s7OPby66VSGMrFfjM0RyxW1HiJX2pZLrHJdzBQA9qmeXwHDdfViwZly2n4tqJCEjscKjZxfe-hfxuPl778gNyixx0IKB2u6IxAYjPjsNWiqMEggz8ihNNq5zpWFIb9oSGpVNcmTSAc3q3hhv_tzu73U4dUJaq5vGyWfl-yZyar4_dbqra0FjdUfMhrlvBnJhqw"
                              - use = "sig"
                            },
                          - {
                              - alg = "RS256"
                              - e   = "AQAB"
                              - kid = "082lLuscwyfwMSpj4J/Z/ZfGIF1l4urGUuy7x1MdKlc="
                              - kty = "RSA"
                              - n   = "vk2oCLQHnIzIBIJ5YZVLMlq_kGJSyBVUYV5NuvMnNpB4-Xh6DY3iNugvaZ79oNnjQtVY11y1Cu4_DRbLGLo1qGWgs5i_kPYt_zeW3oa705-XQ-Kq2qNZowXvwV2J6s8H5_oeSlQ5gdHu-napGly64AYSUEUi9d-UaskwHWgdBv6Ugt8Cp-tZPv-3MzB3a4BsPPVMtnY6ROBv_YH5IQp_qR186v7ERKE_APkPkc3tEf_NzbIrD3rVrlFVEm_YITRqarmv4RwPjdR8AlOIus4PDNKOgx5BMZQNu7tgsfTVsHUlmNpVS1tO4RQ2-jwlGVznFZRvFeICfiueKdzYLmrhHw"
                              - use = "sig"
                            },
                        ]
                    }
                )
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_DEFAULT_REFRESH_RSA_KEYS" = "false"
              - "CONNECTILLY_SECURITY_TOKEN_IDENTITY_PROVIDER_URL"                      = "https://cognito-idp.us-east-1.amazonaws.com/us-east-1_JmhblAAfm/.well-known/jwks.json"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "organization"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "organization_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "d8a7046f-2604-4b33-94b0-0ffbf472b6c9:organization_api"
        name       = "organization_api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "7a902424-5b0f-48b0-9e1d-b99aa7589bc2" -> "d69679e1-a869-4151-9f19-4a5a7e15d8f6"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*